//----------------------------------------------------------------------------------
// [ 문자열 분석 ] https://www.acmicpc.net/problem/10820
//----------------------------------------------------------------------------------

#include <iostream>
int main() {
    char s[102], ch[4] = {'a', 'A', '0', ' '};
    while (fgets(s, 102, stdin)) {
        int arr[4] = {};
        for (int i = 0, j; s[i] != '\0'; ++i) {
            for (j = 0; j < 4 && ch[j] > s[i]; ++j);
            ++arr[j];
        }
        printf("%d %d %d %d\n", arr[0], arr[1], arr[2], arr[3]);
    }
}